PX4/PX4-Autopilot/nuttx/arch/arm/src/sam3u/sam3u_pwm.h
#define PWM_FSR_FIV(n)                 (1 << (n))
#define PWM_FSR_FIV0                   (1 << 0)  /* Bit 0:  Fault Input 0 Value */
#define PWM_FSR_FIV1                   (1 << 1)  /* Bit 1:  Fault Input 1 Value */
#define PWM_FSR_FIV2                   (1 << 2)  /* Bit 2:  Fault Input 2 Value */
#define PWM_FSR_FIV3                   (1 << 3)  /* Bit 3:  Fault Input 3 Value */
#define PWM_FSR_FS(n)                  (1 << ((n)+8))
#define PWM_FSR_FS0                    (1 << 8)  /* Bit 8:  Fault 0 Status */
#define PWM_FSR_FS1                    (1 << 9)  /* Bit 9:  Fault 1 Status */
#define PWM_FSR_FS2                    (1 << 10) /* Bit 10: Fault 2 Status */
#define PWM_FSR_FS3                    (1 << 11) /* Bit 11: Fault 3 Status */

/* PWM Fault Clear Register */

#define PWM_FCR_FCLR(n)                (1 << (n))
#define PWM_FCR_FCLR0                  (1 << 0)  /* Bit 0:  Fault 0 Clear */
#define PWM_FCR_FCLR1                  (1 << 1)  /* Bit 1:  Fault 1 Clear */
#define PWM_FCR_FCLR2                  (1 << 2)  /* Bit 2:  Fault 2 Clear */
#define PWM_FCR_FCLR3                  (1 << 3)  /* Bit 3:  Fault 3 Clear */

/* PWM Fault Protection Value Register */

#define PWM_FPV_FPVH(n)                (1 << (n))
#define PWM_FPV_FPVH0                  (1 << 0)  /* Bit 0:  Fault Protection Value PWMH output channel 0 */
#define PWM_FPV_FPVH1                  (1 << 1)  /* Bit 1:  Fault Protection Value PWMH output channel 1 */
#define PWM_FPV_FPVH2                  (1 << 2)  /* Bit 2:  Fault Protection Value PWMH output channel 2 */
#define PWM_FPV_FPVH3                  (1 << 3)  /* Bit 3:  Fault Protection Value PWMH output channel 3 */
#define PWM_FPV_FPVL(n)                (1 << ((n)+16))
#define PWM_FPV_FPVL0                  (1 << 16) /* Bit 16: Fault Protection Value PWML output channel 0 */
#define PWM_FPV_FPVL1                  (1 << 17) /* Bit 17: Fault Protection Value PWML output channel 1 */
#define PWM_FPV_FPVL2                  (1 << 18) /* Bit 18: Fault Protection Value PWML output channel 2 */
#define PWM_FPV_FPVL3                  (1 << 19) /* Bit 19: Fault Protection Value PWML output channel 3 */

/* PWM Fault Protection Enable Register */

#define PWM_FPE_FPEN(n,y)              (1 << (((n)<<8)+y))
#define PWM_FPE_FPE0(y)                (1 << (y))      /* Bits 0-7:   Fault Protection Enable Fault=y chan=0 */
#define PWM_FPE_FPE1(y)                (1 << ((y)+8))  /* Bits 8-15:  Fault Protection Enable Fault=y chan=1 */
#define PWM_FPE_FPE2(y)                (1 << ((y)+16)) /* Bits 16-23: Fault Protection Enable Fault=y chan=2 */
#define PWM_FPE_FPE3(y)                (1 << ((y)+24)  /* Bits 24-31: Fault Protection Enable Fault=y chan=3 */

/* PWM Event Line 1/2 Register */

#define PWM_ELMR_CSEL(n)               (1 << (n))
#define PWM_ELMR_CSEL0                 (1 << 0)  /* Bit 0:  Comparison 0 Selection */
#define PWM_ELMR_CSEL1                 (1 << 1)  /* Bit 1:  Comparison 1 Selection */
#define PWM_ELMR_CSEL2                 (1 << 2)  /* Bit 2:  Comparison 2 Selection */
#define PWM_ELMR_CSEL3                 (1 << 3)  /* Bit 3:  Comparison 3 Selection */
#define PWM_ELMR_CSEL4                 (1 << 4)  /* Bit 4:  Comparison 4 Selection */
#define PWM_ELMR_CSEL5                 (1 << 5)  /* Bit 5:  Comparison 5 Selection */
#define PWM_ELMR_CSEL6                 (1 << 6)  /* Bit 6:  Comparison 6 Selection */
#define PWM_ELMR_CSEL7                 (1 << 7)  /* Bit 7:  Comparison 7 Selection */

/* PWM Write Protect Control Register */

#define PWM_WPCR_WPCMD_SHIFT           (0)       /* Bits 0-1: Write Protect Command */
#define PWM_WPCR_WPCMD_MASK            (3 << PWM_WPCR_WPCMD_SHIFT)
#define PWM_WPCR_WPRG(n)               (1 << ((n)+2))
#define PWM_WPCR_WPRG0                 (1 << 2)  /* Bit 2:  Write Protect Register Group 0 */
#define PWM_WPCR_WPRG1                 (1 << 3)  /* Bit 3:  Write Protect Register Group 1 */
#define PWM_WPCR_WPRG2                 (1 << 4)  /* Bit 4:  Write Protect Register Group 2 */
#define PWM_WPCR_WPRG3                 (1 << 5)  /* Bit 5:  Write Protect Register Group 3 */
#define PWM_WPCR_WPRG4                 (1 << 6)  /* Bit 6:  Write Protect Register Group 4 */
#define PWM_WPCR_WPRG5                 (1 << 7)  /* Bit 7:  Write Protect Register Group 5 */
#define PWM_WPCR_WPKEY_SHIFT           (8)       /* Bits 8-31:  Write Protect Key */
#define PWM_WPCR_WPKEY_MASK            (0x00ffffff << PWM_WPCR_WPKEY_SHIFT)

/* PWM Write Protect Status Register */

#define PWM_WPSR_WPSWS(n)              (1 << (n))
#define PWM_WPSR_WPSWS0                (1 << 0)  /* Bit 0:  Write Protect SW Status */
#define PWM_WPSR_WPSWS1                (1 << 1)  /* Bit 1:  Write Protect SW Status */
#define PWM_WPSR_WPSWS2                (1 << 2)  /* Bit 2:  Write Protect SW Status */
#define PWM_WPSR_WPSWS3                (1 << 3)  /* Bit 3:  Write Protect SW Status */
#define PWM_WPSR_WPSWS4                (1 << 4)  /* Bit 4:  Write Protect SW Status */
#define PWM_WPSR_WPSWS5                (1 << 5)  /* Bit 5:  Write Protect SW Status */
#define PWM_WPSR_WPVS                  (1 << 7)  /* Bit 7:  Write Protect Violation Status */
#define PWM_WPSR_WPHWS(n)              (1 << ((n)+8))
#define PWM_WPSR_WPHWS0                (1 << 8)  /* Bit 8:  Write Protect HW Status */
#define PWM_WPSR_WPHWS1                (1 << 9)  /* Bit 9:  Write Protect HW Status */
#define PWM_WPSR_WPHWS2                (1 << 10) /* Bit 10: Write Protect HW Status */
#define PWM_WPSR_WPHWS3                (1 << 11) /* Bit 11: Write Protect HW Status */
#define PWM_WPSR_WPHWS4                (1 << 12) /* Bit 12: Write Protect HW Status */
#define PWM_WPSR_WPHWS5                (1 << 13) /* Bit 13: Write Protect HW Status */
#define PWM_WPSR_WPVSRC_SHIFT          (16)      /* Bits 16-31: Write Protect Violation Source */
#define PWM_WPSR_WPVSRC_MASK           (0xffff << PWM_WPSR_WPVSRC_SHIFT)

/* PWM Comparison x Value Register and PWM Comparison x Value Update Register */

#define PWMCMP_CV_SHIFT                (0)       /* Bits 0-23: Comparison x Value */
#define PWMCMP_CV_MASK                 (0x00ffffff << PWMCMP_CV_SHIFT)
#define PWMCMP_CVM                     (1 << 24) /* Bit 24: Comparison x Value Mode */

